# Tap repositories
tap "xcodesorg/made" # For xcodes command

# Base utilities
brew "eza"                    # Modern replacement for ls
brew "gcc"                    # GNU Compiler Collection
brew "gh"                     # GitHub CLI
brew "jq"                     # JSON processor
brew "libffi"                 # Foreign Function Interface library
brew "libyaml"                # YAML parser and emitter
brew "ripgrep"                # Fast search tool
brew "sheldon"                # Plugin manager for shells
brew "starship"               # Cross-shell prompt
brew "wget"                   # Internet file retriever
brew "zellij"                 # Terminal workspace
brew "git-lfs"                # Git extension for large files
brew "mas"                    # Mac App Store command line interface
brew "xcodes"                 # Xcode version manager
brew "gnupg"                  # GNU Privacy Guard
brew "terraform"              # Infrastructure as Code tool
brew "awscli"                 # AWS CLI
brew "uv"                     # Python package manager
brew "mysql"                  # MySQL database
brew "watchman"               # File system event monitoring
brew "gemini-cli"             # Gemini CLI
brew "exercism"               # Platform for coding exercises
brew "mise"                   # Runtime version manager
brew "deno"                   # JavaScript/TypeScript runtime
brew "openssl@3"              # Rails dependency: SSL and TLS toolkit
brew "rust"                   # Rails dependency: Programming language
brew "gmp"                    # Rails dependency: GNU Multiple Precision Arithmetic Library
brew "coreutils"              # GNU core utilities (ls, cp, mv, etc.)
brew "gnu-sed"                # GNU stream editor
brew "gnu-tar"                # GNU tar archiving utility
brew "grep"                   # GNU grep searching utility
brew "findutils"              # GNU find, locate, updatedb, xargs
brew "gnu-time"               # GNU time
brew "libpq"                  # PostgreSQL interface
brew "buf"                    # Protocol Buffers tooling

# GUI applications
cask "brave-browser"          # Web browser
cask "visual-studio-code"     # Code editor
cask "jetbrains-toolbox"      # JetBrains tools manager
cask "unity-hub"              # Unity game engine manager
cask "slack"                  # Team communication
cask "discord"                # Voice and text chat
cask "karabiner-elements"     # Keyboard customization tool
cask "git-credential-manager" # Cross-platform Git credential helper
cask "windows-app"            # Remote desktop
cask "docker"                 # Docker container manager
cask "licecap"                # GIF screen capture tool
cask "claude"                 # AI assistant
cask "ghostty"                # Terminal for AI interactions
cask "wireguard-tools"        # VPN software
cask "zulu@17"                # OpenJDK distribution for Java 17
cask "github-copilot-for-xcode" # Github copilot for Xcode
cask "claude-code"            # AI coding agent by Anthropic
cask "aqua-voice"             # AI voice tool

# Fonts
cask "font-jetbrains-mono-nerd-font"

# Mac App Store applications
mas "Skitch", id: 425955336       # Screenshot editing and sharing tool
mas "WireGuard", id: 1451685025   # VPN client and server
